# Data Manipulation with Pandas

In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /home/sheik/.local/lib/python3.8/site-packages (1.4.1)
Requirement already satisfied: numpy>=1.18.5 in /home/sheik/.local/lib/python3.8/site-packages (from pandas) (1.22.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/sheik/.local/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/sheik/.local/lib/python3.8/site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in /home/sheik/.local/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
WARNING: You are using pip version 21.3.1; however, version 22.0.4 is available.
You should consider upgrading via the '/bin/python3 -m pip install --upgrade pip' command.

## Series

In [2]:
import numpy as np
import pandas as pd

In [3]:
first_series = pd.Series(list('abcdef'))

In [4]:
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [5]:
np_country = np.array(['India', 'Pakistan', 'Japan', 'USA', 'UK', 'Germany'])

In [9]:
s_country = pd.Series(np_country)

In [10]:
print(s_country)

0       India
1    Pakistan
2       Japan
3         USA
4          UK
5     Germany
dtype: object

In [24]:
country_gdp = pd.Series([122222, 23324, 435646, 5645,3746587, 3436764], index=['India', 'Pakistan', 'Japan', 'USA', 'UK', 'Germany'])

In [25]:
print(country_gdp)

India        122222
Pakistan      23324
Japan        435646
USA            5645
UK          3746587
Germany     3436764
dtype: int64

In [14]:
# Print series with scalar
scalar_series = pd.Series(5, index=['a', 'b', 'c', 'd', 'e', 'f'])

In [15]:
scalar_series

a    5
b    5
c    5
d    5
e    5
f    5
dtype: int64

In [26]:
# Accessing elements in series
country_gdp[0]

122222

In [27]:
country_gdp[0:2]

India       122222
Pakistan     23324
dtype: int64

In [28]:
# Using loc and iloc
country_gdp.loc['USA']

5645

In [29]:
country_gdp.iloc[1]

23324

## Dataframe

In [1]:
import pandas as pd

In [4]:
olympic_datalist = {'HostCity':['London', 'Beijing', 'Sydney'], 'Year':[2012, 2008, 2004], 'Participating Countries':[203, 204, 205]}

In [5]:
df_olympic_data = pd.DataFrame(olympic_datalist)

In [8]:
df_olympic_data

  HostCity  Year  Participating Countries
0   London  2012                      203
1  Beijing  2008                      204
2   Sydney  2004                      205

In [9]:
olympic_dataDict = {'London':{2012:200}, 'Beijing':{2008:200}}

In [10]:
df_olympic_dataDict = pd.DataFrame(olympic_dataDict)

In [11]:
df_olympic_dataDict

      London  Beijing
2012   200.0      NaN
2008     NaN    200.0

In [12]:
df_olympic_data.HostCity

0     London
1    Beijing
2     Sydney
Name: HostCity, dtype: object

In [13]:
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  Participating Countries
0   London  2012                      203
1  Beijing  2008                      204
2   Sydney  2004                      205>

In [17]:
# Dataframe from dictionary of series
olympic_participation = pd.Series([200, 201, 202, 203], index=[2012, 2008, 2007, 2006])
olympic_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney'], index=[2012, 2008,2007, 2006])

In [18]:
df_olympic_series = pd.DataFrame({'Participating Countries': olympic_participation,
                                 'Host Cities': olympic_country})

In [19]:
df_olympic_series

      Participating Countries Host Cities
2012                      200      London
2008                      201     Beijing
2007                      202      Athens
2006                      203      Sydney

In [20]:
# Dataframe from ndarray

import numpy as np

In [25]:
np_array_year = np.array([2012, 2008, 2007, 2006])
np_array_country = np.array(['London', 'Beijing', 'Athens', 'Sydney'])
dict_ndarray = {'Year':np_array_year, 'Host': np_array_country}

In [26]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [27]:
df_ndarray

   Year     Host
0  2012   London
1  2008  Beijing
2  2007   Athens
3  2006   Sydney

In [28]:
# Dataframe from Dataframe
df_from_df = pd.DataFrame(df_olympic_series)

In [29]:
df_from_df

      Participating Countries Host Cities
2012                      200      London
2008                      201     Beijing
2007                      202      Athens
2006                      203      Sydney

In [6]:
import numpy as np
import pandas as pd

In [7]:
olympic_series_participation = pd.Series([205, 204, 201, 200, 197], index=[2012, 2008, 2004, 2000, 1996])
olympic_series_country = pd.Series(['London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], index=[2012, 2008, 2004, 2000, 1996])


df_olympic_series = pd.DataFrame({'Participating Countries': olympic_series_participation, 'Host Cities':olympic_series_country})

In [8]:
df_olympic_series

      Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing
2004                      201      Athens
2000                      200      Sydney
1996                      197     Atlanta

In [9]:
df_olympic_series.describe

<bound method NDFrame.describe of       Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing
2004                      201      Athens
2000                      200      Sydney
1996                      197     Atlanta>

In [10]:
df_olympic_series.head(2)

      Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing

In [11]:
df_olympic_series.tail(3)

      Participating Countries Host Cities
2004                      201      Athens
2000                      200      Sydney
1996                      197     Atlanta

In [12]:
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [13]:
df_olympic_series.columns

Index(['Participating Countries', 'Host Cities'], dtype='object')

In [14]:
df_olympic_series['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [15]:
df_olympic_series['Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: Participating Countries, dtype: int64

In [16]:
 df_olympic_series.iloc[0:2]

      Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing

In [17]:
df_olympic_series.loc[2012]

Participating Countries       205
Host Cities                London
Name: 2012, dtype: object

In [18]:
df_olympic_series.iat[3, 0]

200

In [19]:
df_olympic_series[df_olympic_series['Participating Countries'] > 200]

      Participating Countries Host Cities
2012                      205      London
2008                      204     Beijing
2004                      201      Athens

In [20]:
# Missing Values
import pandas as pd

In [21]:
first_series = pd.Series([1,2,3,4,5], index=['a', 'b', 'c', 'd', 'e'])
second_series = pd.Series([10, 20, 30, 40, 50], index=['c', 'e', 'f', 'g', 'h'])

In [22]:
sum_of_series = first_series + second_series

In [23]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [24]:
dropna_s = sum_of_series.dropna()

In [25]:
dropna_s

c    13.0
e    25.0
dtype: float64

In [26]:
fillna_s = sum_of_series.fillna(0)

In [27]:
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [28]:
fill_Nan_with_before_sum = first_series.add(second_series, fill_value=0)

In [29]:
fill_Nan_with_before_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

## Data Operations

In [1]:
import pandas as pd

In [2]:
df_movie_rating = pd.DataFrame({
    'movie 1': [5,4,3,3,2,1],
    'movie 2': [4,5,2,3,4,2]},
    index = ['Tanjiro', 'Vegeta', 'Jotaro', 'Gojo', 'Eren', 'Deku'])

In [3]:
df_movie_rating

         movie 1  movie 2
Tanjiro        5        4
Vegeta         4        5
Jotaro         3        2
Gojo           3        3
Eren           2        4
Deku           1        2

In [4]:
# Declare a custom function

def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    if rating == 2:
        return 'D'
    else:
        return 'E'

In [5]:
print(movie_grade(1))

E

In [6]:
# DataFrame.applymap(custom_func) is used to map the data

df_movie_rating.applymap(movie_grade)

        movie 1 movie 2
Tanjiro       A       B
Vegeta        B       A
Jotaro        C       D
Gojo          C       C
Eren          D       B
Deku          E       D

In [7]:
df_test_scores = pd.DataFrame({
    'Test 1': [95, 84, 73, 88, 82, 61],
    'Test 2': [74, 85, 82, 73, 77, 79]
}, index = ['Goku', 'Yuji', 'Dio', 'Yahiko', 'Midoriya', 'Inosuke'])

In [8]:
df_test_scores.max()

Test 1    95
Test 2    85
dtype: int64

In [9]:
df_test_scores.mean()

Test 1    80.500000
Test 2    78.333333
dtype: float64

In [10]:
df_test_scores.std()

Test 1    11.979149
Test 2     4.633213
dtype: float64

In [11]:
# groupby in pandas

df_president_name = pd.DataFrame({'first': ['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
                                 'last': ['Bush', 'Clinton', 'Regan', 'Carter', 'Washington']})

In [12]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [13]:
grouped = df_president_name.groupby('first')

In [14]:
grouped

In [15]:
grp_data = grouped.get_group('George')

In [16]:
grp_data

    first        last
0  George        Bush
4  George  Washington

In [17]:
# sort_values

df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

In [18]:
df_president_name.sort_values('last')

    first        last
0  George        Bush
3   Jimmy      Carter
1    Bill     Clinton
2  Ronald       Regan
4  George  Washington

## Data Standardization

In [19]:
def standardize_tests(test):
    return (test-test.mean())/ test.std()

In [20]:
standardize_tests(df_test_scores['Test 1'])

Goku        1.210437
Yuji        0.292174
Dio        -0.626088
Yahiko      0.626088
Midoriya    0.125218
Inosuke    -1.627829
Name: Test 1, dtype: float64

In [21]:
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [22]:
standardize_test_scores(df_test_scores)

            Test 1    Test 2
Goku      1.210437 -0.935276
Yuji      0.292174  1.438886
Dio      -0.626088  0.791387
Yahiko    0.626088 -1.151109
Midoriya  0.125218 -0.287777
Inosuke  -1.627829  0.143889

In [23]:
df_student_math = pd.DataFrame({
    'student': ['Rengoku', 'Tengen', 'Zenitsu', 'Nezuko', 'Akaza', 'Muzan'],
    'ID': [10, 56, 31, 85, 9, 22]
})

In [24]:
df_student_science = pd.DataFrame({'student': ['Rengoku', 'Akaza', 'Tengen'], 'ID': [10, 9, 56]})

In [25]:
# Merge

pd.merge(df_student_math, df_student_science)

   student  ID
0  Rengoku  10
1   Tengen  56
2    Akaza   9

In [26]:
# merge with key on student

pd.merge(df_student_math, df_student_science, on='student')

   student  ID_x  ID_y
0  Rengoku    10    10
1   Tengen    56    56
2    Akaza     9     9

In [27]:
# merge left join on key ID and also fill NaN values with X

pd.merge(df_student_math, df_student_science, on='ID', how='left').fillna('X')

  student_x  ID student_y
0   Rengoku  10   Rengoku
1    Tengen  56    Tengen
2   Zenitsu  31         X
3    Nezuko  85         X
4     Akaza   9     Akaza
5     Muzan  22         X

In [28]:
# concatenate dataframes

pd.concat([df_student_math, df_student_science], ignore_index = True)

   student  ID
0  Rengoku  10
1   Tengen  56
2  Zenitsu  31
3   Nezuko  85
4    Akaza   9
5    Muzan  22
6  Rengoku  10
7    Akaza   9
8   Tengen  56

In [29]:
df_student_survey_data = pd.DataFrame({
    'student': ['Rengoku', 'Tengen', 'Zenitsu', 'Nezuko', 'Akaza', 'Muzan'],
    'ID': [10, 56, 22, 85, 56, 22]
})

In [30]:
df_student_survey_data

   student  ID
0  Rengoku  10
1   Tengen  56
2  Zenitsu  22
3   Nezuko  85
4    Akaza  56
5    Muzan  22

In [34]:
# Check for duplicates

print(df_student_survey_data.duplicated('ID'))

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [32]:
# drop duplicates with student as key

df_student_survey_data.drop_duplicates('student')

   student  ID
0  Rengoku  10
1   Tengen  56
2  Zenitsu  22
3   Nezuko  85
4    Akaza  56
5    Muzan  22

In [33]:
df_student_survey_data.drop_duplicates('ID')

   student  ID
0  Rengoku  10
1   Tengen  56
2  Zenitsu  22
3   Nezuko  85

## Pandas SQL Operation

In [35]:
import pandas as pd

In [37]:
import sqlite3

In [ ]:
create_table = """
CREATE TABLE student_score (
Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL);"""